todo/ruby/todo-better/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
  def index
    render json: Task.all

INSERT INTO "tasks" ("description", "done", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Learn Data Science"], ["done", 0], ["created_at", "2020-04-22 14:53:08.077163"], ["updated_at", "2020-04-22 14:53:08.077163"]]
---
  def create
    render json: Task.create(task_params)

UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Learn Big Data"], ["updated_at", "2020-04-22 14:58:20.164065"], ["id", 6]]
---
  def update
    @task.update(task_params)